#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

Перем ГлавныйКонтекст;

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Инициализирует обработку, устанавливая главный контекст для дальнейшей работы.
//
// Параметры:
//   ПараметрыИнициализации - Структура:
//       * ГлавныйКонтекст - ВнешниеОбработки.СозданиеЗаказов - контекст основной обработки.
//
//@skip-check doc-comment-type
Процедура Инициализировать(ПараметрыИнициализации) Экспорт
	
	ГлавныйКонтекст = ПараметрыИнициализации.ГлавныйКонтекст;
	
КонецПроцедуры

Процедура ЗаполнитьТипыДанныхДляРеквизитов() Экспорт
	
	ТипыДанныхДляРеквизитов = ГлавныйКонтекст.ПараметрыКонтекста.ТипыДанныхДляРеквизитов;
	ТипыДанныхДляРеквизитов.Контрагенты = Новый ОписаниеТипов("СправочникСсылка._ДемоДоговорыКонтрагентов");
	ТипыДанныхДляРеквизитов.Номенклатура = Новый ОписаниеТипов("СправочникСсылка._ДемоНоменклатура");
	ТипыДанныхДляРеквизитов.ЗаказКлиента = Новый ОписаниеТипов("ДокументСсылка._ДемосчетНаОплатуПокупателю");
	
КонецПроцедуры

Процедура СоздатьЗаказ() Экспорт
	
	СчетНаОплатуПокупателю = Документы._ДемоСчетНаОплатуПокупателю.СоздатьДокумент();
	СчетНаОплатуПокупателю.Заполнить(Неопределено);
	
	СчетНаОплатуПокупателю.Организация = Справочники._ДемоОрганизации.ОрганизацияПоУмолчанию();
	СчетНаОплатуПокупателю.Дата = ГлавныйКонтекст.ДатаДокумента;
	СчетНаОплатуПокупателю.Договор = ГлавныйКонтекст.Контрагент;
	Если ЗначениеЗаполнено(СчетНаОплатуПокупателю.Договор) Тогда
		ДанныеИзДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СчетНаОплатуПокупателю.Договор,
			"Организация, Партнер, Владелец, ВалютаРасчетов");
		СчетНаОплатуПокупателю.Организация = ДанныеИзДоговора.Организация;
		СчетНаОплатуПокупателю.Партнер = ДанныеИзДоговора.Партнер;
		СчетНаОплатуПокупателю.Контрагент = ДанныеИзДоговора.Владелец;
		СчетНаОплатуПокупателю.ВалютаДокумента = ДанныеИзДоговора.ВалютаРасчетов;
	КонецЕсли;
	
	Товары = СчетНаОплатуПокупателю.Товары;
	
	Для Каждого СтрокаЗаказа Из ГлавныйКонтекст.Товары Цикл
		
		СтрокаДокумента = Товары.Добавить();
		
		ЗаполнитьЗначенияСвойств(СтрокаДокумента, СтрокаЗаказа);
		СтрокаДокумента.Сумма = СтрокаЗаказа.Количество * СтрокаЗаказа.Цена;
		СтрокаДокумента.Всего = СтрокаДокумента.Сумма;
		
	КонецЦикла;
	
	// Не нашел как заполнить Подразделение, поэтому без ПроверкаЗаполнения()
	Попытка
		СчетНаОплатуПокупателю.Записать();
		
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Записан документ %1 по контрагенту %2'"),
			СчетНаОплатуПокупателю,
			ГлавныйКонтекст.Контрагент);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	Исключение
		ВызватьИсключение;
	КонецПопытки;
	
	ГлавныйКонтекст.ЗавершитьСозданиеЗаказа(СчетНаОплатуПокупателю.Ссылка);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции



#КонецОбласти

#Иначе
	ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
